quiz = [
    {
        "question": "ما هي لغة البرمجة التي تُستخدم غالبًا في الذكاء الاصطناعي وتعلم الآلة؟",
        "choices" : ["Java", "Python", "HTML"],
        "answer": "Python"
    },  
    {
        "question": "أي من هذه العناصر يُعتبر من طبقة الشبكة (Network Layer) في نموذج OSI؟",
        "choices" : ["IP", "TCP", "HTTP"],
        "answer": "IP"
    },    
    {
        "question": "ما هو اسم التقنية التي يستخدمها الحاسب لتحويل الصوت إلى نص؟",
        "choices" : ["التعرف على الأنماط", "التعرف على الكلام", "التعرف على الصور"],
        "answer": "التعرف على الكلام"
    },    
    {
        "question": "أي من هذه القيم يعتبر عنوان IP من الإصدار الرابع (IPv4)؟",
        "choices" : ["192.168.1.1", "2001:db8::1", "fe80::1"],
        "answer": "192.168.1.1"
    },    
    {
        "question": "ما هو الاختصار الشائع لكلمة الذكاء الاصطناعي بالإنجليزية؟",
        "choices" : ["AI", "ML", "IT"],
        "answer": "AI"
    }
]
